; domain
(define (domain robot)
  (:requirements :strips :typing)
  (:types room obj robot)
  (:predicates
    (at-robot ?r - robot ?l - room) (at-obj ?b - obj ?r - room)
    (free ?r - robot) (carry ?o - obj ?r - robot)
    (allowed ?r - robot ?l - room))

	(:action move
		:parameters     (?r - robot ?a - room ?b - room)
		:precondition   (and  (at-robot ?r ?a) (allowed ?r ?b))
		:effect         (and  (at-robot ?r ?b) (not (at-robot ?r ?a))))

	(:action pick
		:parameters     (?o - obj ?l - room ?r - robot)
		:precondition   (and  (at-obj ?o ?l) (at-robot ?r ?l) (free ?r))
		:effect         (and (carry ?o ?r) (not (at-obj ?o ?l))
                    (not (free ?r))))

	(:action drop
		:parameters     (?o - obj ?l - room ?r - robot)
		:precondition   (and  (carry ?o ?r) (at-robot ?r ?l))
    :effect         (and (at-obj ?o ?l) (free ?r)
                    (not (carry ?o ?r))))
)

; problem
(define (problem pb1)
	(:domain robot)
	(:objects
		roomA - room
		roomB - room
		roomC - room
		ball1 - obj
		ball2 - obj
		eve - robot
		wally - robot
	)
	(:init
		(at-robot wally roomA)
		(at-robot eve roomB)
		(free wally)
		(free eve)
		(at-obj ball1 roomA)
		(at-obj ball2 roomA)
		(allowed wally roomA)
		(allowed wally roomB)
		(allowed eve roomB)
		(allowed eve roomC)
	)
	(:goal
		(and (at-obj ball1 roomC)
			(at-obj ball2 roomC))
	)
)

; plan
1. (pick ball1 rooma wally)
   deleted: (at-obj ball1 rooma) (free wally)
   added: (carry ball1 wally)
   goals met: 0 of 2
2. (move wally rooma roomb)
   deleted: (at-robot wally rooma)
   added: (at-robot wally roomb)
   goals met: 0 of 2
3. (drop ball1 roomb wally)
   deleted: (carry ball1 wally)
   added: (at-obj ball1 roomb) (free wally)
   goals met: 0 of 2
4. (pick ball1 roomb eve)
   deleted: (at-obj ball1 roomb) (free eve)
   added: (carry ball1 eve)
   goals met: 0 of 2
5. (move wally roomb rooma)
   deleted: (at-robot wally roomb)
   added: (at-robot wally rooma)
   goals met: 0 of 2
6. (move eve roomb roomc)
   deleted: (at-robot eve roomb)
   added: (at-robot eve roomc)
   goals met: 0 of 2
7. (pick ball2 rooma wally)
   deleted: (at-obj ball2 rooma) (free wally)
   added: (carry ball2 wally)
   goals met: 0 of 2
8. (drop ball1 roomc eve)
   deleted: (carry ball1 eve)
   added: (at-obj ball1 roomc) (free eve)
   goals met: 1 of 2
9. (move wally rooma roomb)
   deleted: (at-robot wally rooma)
   added: (at-robot wally roomb)
   goals met: 1 of 2
10. (move eve roomc roomb)
   deleted: (at-robot eve roomc)
   added: (at-robot eve roomb)
   goals met: 1 of 2
11. (drop ball2 roomb wally)
   deleted: (carry ball2 wally)
   added: (at-obj ball2 roomb) (free wally)
   goals met: 1 of 2
12. (pick ball2 roomb eve)
   deleted: (at-obj ball2 roomb) (free eve)
   added: (carry ball2 eve)
   goals met: 1 of 2
13. (move eve roomb roomc)
   deleted: (at-robot eve roomb)
   added: (at-robot eve roomc)
   goals met: 1 of 2
14. (drop ball2 roomc eve)
   deleted: (carry ball2 eve)
   added: (at-obj ball2 roomc) (free eve)
   goals met: 2 of 2
